# [m:] 代表列表中的第m + 1 项到最后一项

# [: n] 代表列表中的第一项到第n项

import numpy as np

a = [1, 2, 3.4, 5]
print(a)
# [1 2 3 4 5]

print(a[-1])
# 取最后一个元素结果：[5]

print(a[:-1])
# 除了最后一个取全部 结果：[1 2 3 4]

print(a[::-1])
# 取从后向前（相反）的元素 结果：[5 4 3 2 1]

print(a[2::-1])
# 取从下标为2的元素翻转读取 结果：[3 2 1]

print(a[1:])
# 取第二个到最后一个元素 结果：[2 3 4 5]

list=range(100)
#正着切片
_list = list[:10]
# for i in _list:
#     print(i)
print(len(_list))
# [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
#负索引切片
print(list[-10:])
# [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]
#倒着切片
print(list[10:0:-1])
# [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]
print(list[-1:-10:-1])
# [99, 98, 97, 96, 95, 94, 93, 92, 91]
#跳着切片
print(list[::10])
# [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]